from config import OWNER_USERNAME, SUPPORT_GRP
from shizuchat import shizuchat
from pyrogram import Client, filters



START = """**
ɪ ᴀᴍ {} ᴄʜᴀᴛʙᴏᴛ 💞
**"""

OWNER = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {shizuchat.mention}:

➻ /broadcast ᴛᴏ ғᴏʀᴡᴀʀᴅ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄʜᴀᴛs ʙᴀsᴇᴅ ᴏɴ sᴘᴇᴄɪғɪᴇᴅ ғʟᴀɢs!\nᴇxᴀᴍᴘʟᴇ: `/broadcast -user -pin ʜᴇʟʟᴏ ғʀɪᴇɴᴅs`
──────────────
➻ /restart  ʀᴇsᴛᴀʀᴛ &  ᴜᴘᴅᴀᴛᴇ ʀᴇᴘᴏ.  
──────────────
"""

HELP_READ = f"""**
Cʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ʙᴇʟᴏᴡ ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏʀᴍᴀᴛɪᴏɴ.

Aʟʟ ᴄᴏᴍᴍᴀɴᴅs ᴄᴀɴ ʙᴇ ᴜsᴇᴅ ᴡɪᴛʜ: /**
"""

TOOLS_DATA_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {shizuchat.mention}:

➻ /start ᴛᴏ ᴡᴀᴋᴇ ᴜᴘ ᴛʜᴇ ʙᴏᴛ ᴀɴᴅ ʀᴇᴄᴇɪᴠᴇ ᴀ ᴡᴇʟᴄᴏᴍᴇ ᴍᴇssᴀɢᴇ!
──────────────
➻ /help ғᴏʀ ɢᴇᴛᴛɪɴɢ ᴅᴇᴛᴀɪʟs ᴀʙᴏᴜᴛ ᴀʟʟ ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ғᴇᴀᴛᴜʀᴇs.
──────────────
➻ /ping ᴛᴏ ᴄʜᴇᴄᴋ ᴛʜᴇ ʀᴇsᴘᴏɴsᴇ ᴛɪᴍᴇ (ᴘɪɴɢ) ᴏғ ᴛʜᴇ ʙᴏᴛ!
──────────────
➻ /id ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴜsᴇʀ ɪᴅ, ᴄʜᴀᴛ ɪᴅ, ᴀɴᴅ ᴍᴇssᴀɢᴇ ɪᴅ ᴀʟʟ ɪɴ ᴏɴᴇ ᴍᴇssᴀɢᴇ.
──────────────
➻ ᴜsᴇ /repo ᴛᴏ ɢᴇᴛ ᴛʜᴇ sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ ᴏғ ᴛʜᴇ ʙᴏᴛ!
──────────────
➻ ᴜsᴇ /emoji /love ᴛᴇxᴛ ᴛᴏ ᴇᴍᴏᴊɪ.
──────────────
➻ ᴜsᴇ /rmbg ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴘʜᴏᴛᴏ ᴛᴏ ʀᴇᴍᴏᴠᴇ ɪᴛ'ꜱ ʙᴀᴄᴋɢʀᴏᴜᴅ.
──────────────
➻ ᴜsᴇ /afk /brb <text> ɢɪᴠᴇꜱ ᴀᴜᴛᴏ ʀᴇᴘʟʏ ᴡʜᴇɴ ʏᴏᴜ ᴀʀᴇ ᴏꜰꜰʟɪɴᴇ
──────────────
➻ ᴜsᴇ /rankings /overall ᴜsᴇʀ ᴍsɢ ʟᴇᴀᴅᴇʀʙᴏᴀʀᴅ .
──────────────
๏ ᴍᴀᴅᴇ ʙʏ ➪ [𝐊 𝐀 𝐍 𝐇 Λ](https://t.me/Oyekanhaa) 💞**
"""

AIBOT_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {shizuchat.mention}:

➻ ᴜsᴇ /ai - ɪ ᴀsᴋ ᴀɴʏ ǫᴜᴇᴅᴛɪᴏɴ .
──────────────
➻ ᴜsᴇ /gemini - ɪ ᴀsᴋ ᴀɴʏ ǫᴜᴇᴅᴛɪᴏɴ .
──────────────
➻ ᴜsᴇ /bard ᴡʀɪᴛᴇ ꜱʜᴏʀᴛꜱ ɴᴏᴛᴇꜱ ᴏɴ ʜᴜᴍᴀɴ ᴇʏᴇꜱ
──────────────
➻ ᴜsᴇ /blackbox ᴡʀɪᴛᴇ ꜱɪᴍᴘʟᴇ ꜰʟᴀꜱᴋ ᴀᴘᴘ ᴄᴏᴅᴇ
──────────────
📡 ᴍᴀᴅᴇ ʙʏ ➪ [𝐊 𝐀 𝐍 𝐇 Λ](https://t.me/oyekanhaa) 💞**
"""

CHATBOT_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {shizuchat.mention}:

➻ /chatbot - ᴏᴘᴇɴs ᴏᴘᴛɪᴏns ᴛᴏ ᴇɴᴀʙʟᴇ ᴏʀ ᴅɪsᴀʙʟᴇ ᴛʜᴇ ᴄʜᴀᴛʙᴏᴛ.
──────────────
"""

SOURCE_READ = f"**ʜᴇʏ, ᴛʜᴇ sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ ᴏғ [{shizuchat.name}](https://t.me/{shizuchat.username}) ɪs ɢɪᴠᴇɴ ʙᴇʟᴏᴡ.**\n**ᴘʟᴇᴀsᴇ ғᴏʀᴋ ᴛʜᴇ ʀᴇᴘᴏ & ɢɪᴠᴇ ᴛʜᴇ sᴛᴀʀ ✯**\n**──────────────────**\n**ʜᴇʀᴇ ɪs ᴛʜᴇ [sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ](https://gitlab.com/Badhacker98/Chatbot/-/forks/new)**\n**──────────────────**\n**ɪғ ʏᴏᴜ ғᴀᴄᴇ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ ᴛʜᴇɴ ᴄᴏɴᴛᴀᴄᴛ ᴀᴛ [sᴜᴘᴘᴏʀᴛ ᴄʜᴀᴛ](https://t.me/{SUPPORT_GRP}).\n<b>||©️ @{OWNER_USERNAME}||</b>"

ADMIN_READ2 = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {shizuchat.mention}:

➻ ᴜsᴇ /purge [n] - ᴘᴜʀɢᴇ "ɴ" ɴᴜᴍʙᴇʀ ᴏꜰ ᴍᴇꜱꜱᴀɢᴇꜱ ꜰʀᴏᴍ ʀᴇᴘʟɪᴇᴅ ᴍᴇꜱꜱᴀɢᴇ .
──────────────
➻ ᴜsᴇ /del - ᴅᴇʟᴇᴛᴇ ʀᴇᴘʟɪᴇᴅ ᴍᴇꜱꜱᴀɢᴇ .
──────────────
➻ ᴜsᴇ /promote - ᴘʀᴏᴍᴏᴛᴇ ᴀ ᴍᴇᴍʙᴇʀ .
──────────────
➻ ᴜsᴇ /fullpromote - ᴘʀᴏᴍᴏᴛᴇ ᴀ ᴍᴇᴍʙᴇʀ ᴡɪᴛʜ ᴀʟʟ ʀɪɢʜᴛꜱ .
──────────────
➻ ᴜsᴇ /demote - ᴅᴇᴍᴏᴛᴇ ᴀ ᴍᴇᴍʙᴇʀ .
──────────────
➻ ᴜsᴇ /pin - ᴘɪɴ ᴀ ᴍᴇꜱꜱᴀɢᴇ .
──────────────
➻ ᴜsᴇ /unpin - ᴜɴᴘɪɴ ᴀ ᴍᴇꜱꜱᴀɢᴇ .
──────────────
➻ ᴜsᴇ /unpinall - ᴜɴᴘɪɴᴀʟʟ ᴍᴇꜱꜱᴀɢᴇꜱ .
──────────────
➻ ᴜsᴇ /mute - ᴍᴜᴛᴇ ᴀ ᴜꜱᴇʀ .
──────────────
➻ ᴜsᴇ /tmute - ᴍᴜᴛᴇ ᴀ ᴜꜱᴇʀ ꜰᴏʀ ꜱᴘᴇᴄɪꜰɪᴄ ᴛɪᴍᴇ.
──────────────
➻ ᴜsᴇ /unmute - ᴜɴᴍᴜᴛᴇ ᴀ ᴜꜱᴇʀ .
──────────────
๏ ᴍᴀᴅᴇ ʙʏ ➪ [𝐊 𝐀 𝐍 𝐇 Λ](https://t.me/oyekanhaa) 💞**
"""

ADMIN_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {shizuchat.mention}:

➻ ᴜsᴇ /ban - ʙᴀɴ ᴀ ᴜꜱᴇʀ .
──────────────
➻ ᴜsᴇ /sban - ᴅᴇʟᴇᴛᴇ ᴀʟʟ ᴍᴇꜱꜱᴀɢᴇꜱ ᴏꜰ ᴜꜱᴇʀ ᴛʜᴀᴛ ꜱᴇɴᴅᴇᴅ ɪɴ ɢʀᴏᴜᴘ ᴀɴᴅ ʙᴀɴ ᴛʜᴇ ᴜꜱᴇʀ .
──────────────
➻ ᴜsᴇ /tban - ʙᴀɴ ᴀ ᴜꜱᴇʀ ꜰᴏʀ ꜱᴘᴇᴄɪꜰɪᴄ ᴛɪᴍᴇ .
──────────────
➻ ᴜsᴇ /unban - ᴜɴʙᴀɴ ᴀ ᴜꜱᴇʀ .
──────────────
➻ ᴜsᴇ /warn - ᴡᴀʀɴ ᴀ ᴜꜱᴇʀ .
──────────────
➻ ᴜsᴇ /swarn - ᴅᴇʟᴇᴛᴇ ᴀʟʟ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ ꜱᴇɴᴅᴇᴅ ɪɴ ɢʀᴏᴜᴘ ᴀɴᴅ ᴡᴀʀɴ ᴛʜᴇ ᴜꜱᴇʀ .
──────────────
➻ ᴜsᴇ /rmwarns - ʀᴇᴍᴏᴠᴇ ᴀʟʟ ᴡᴀʀɴɪɴɢ ᴏꜰ ᴀ ᴜꜱᴇʀ .
──────────────
➻ ᴜsᴇ /warns - ꜱʜᴏᴡ ᴡᴀʀɴɪɴɢ ᴏꜰ ᴀ ᴜꜱᴇʀ .
──────────────
๏ ᴍᴀᴅᴇ ʙʏ ➪ [𝐊 𝐀 𝐍 𝐇 Λ](https://t.me/oyekanhaa) 💞**
"""

ABOUT_READ = f"""
**➻ [{shizuchat.name}](https://t.me/{shizuchat.username}) ɪs ᴀɴ ᴀɪ ʙᴀsᴇᴅ ᴄʜᴀᴛ-ʙᴏᴛ.**
**➻ [{shizuchat.name}](https://t.me/{shizuchat.username}) ʀᴇᴘʟɪᴇs ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ ᴛᴏ ᴀ ᴜsᴇʀ.**
**➻ ʜᴇʟᴘs ʏᴏᴜ ɪɴ ᴀᴄᴛɪᴠᴀᴛɪɴɢ ʏᴏᴜʀ ɢʀᴏᴜᴘs.**
**➻ ᴡʀɪᴛᴛᴇɴ ɪɴ [ᴘʏᴛʜᴏɴ](https://www.python.org) ᴡɪᴛʜ [ᴍᴏɴɢᴏ-ᴅʙ](https://www.mongodb.com) ᴀs ᴀ ᴅᴀᴛᴀʙᴀsᴇ**
**──────────────**
**➻ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ɢɪᴠᴇɴ ʙᴇʟᴏᴡ ғᴏʀ ɢᴇᴛᴛɪɴɢ ʙᴀsɪᴄ ʜᴇʟᴩ ᴀɴᴅ ɪɴғᴏ ᴀʙᴏᴜᴛ [{shizuchat.name}](https://t.me/{shizuchat.username})**
"""
